; ModuleID = 'cnminer0-e4555037bd6402804b4cf42ac053e1be.rs'
source_filename = "cnminer0-e4555037bd6402804b4cf42ac053e1be.rs"
target datalayout = "e-m:w-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%str_slice = type { i8*, i64 }
%"core::fmt::ArgumentV1" = type { %"core::fmt::Void"*, [0 x i8], i8 (%"core::fmt::Void"*, %"core::fmt::Formatter"*)*, [0 x i8] }
%"core::fmt::Void" = type { {}, [0 x i8] }
%"core::fmt::Formatter" = type { %"core::option::Option<usize>", [0 x i8], %"core::option::Option<usize>", [0 x i8], { i8*, void (i8*)** }, [0 x i8], %"core::slice::Iter<core::fmt::ArgumentV1>", [0 x i8], { %"core::fmt::ArgumentV1"*, i64 }, [0 x i8], i32, [0 x i8], i32, [0 x i8], i8, [7 x i8] }
%"core::option::Option<usize>" = type { i64, [0 x i64], [1 x i64] }
%"core::slice::Iter<core::fmt::ArgumentV1>" = type { %"core::fmt::ArgumentV1"*, [0 x i8], %"core::fmt::ArgumentV1"*, [0 x i8], %"core::marker::PhantomData<&core::fmt::ArgumentV1>", [0 x i8] }
%"core::marker::PhantomData<&core::fmt::ArgumentV1>" = type {}
%"core::ops::range::Range<usize>" = type { i64, [0 x i8], i64, [0 x i8] }
%"core::ops::range::RangeFrom<usize>" = type { i64, [0 x i8] }
%"alloc::vec::Vec<u8>" = type { %"alloc::raw_vec::RawVec<u8, alloc::heap::Heap>", [0 x i8], i64, [0 x i8] }
%"alloc::raw_vec::RawVec<u8, alloc::heap::Heap>" = type { %"core::ptr::Unique<u8>", [0 x i8], i64, [0 x i8], %"alloc::heap::Heap", [0 x i8] }

!61 = !DINamespace(name: "stdio", scope: !62, file: !3)
!62 = !DINamespace(name: "io", scope: !63, file: !3)
!63 = !DINamespace(name: "std", scope: null, file: !3)
!64 = !{!65, !66}
!65 = !DIEnumerator(name: "Real", value: 0)
!66 = !DIEnumerator(name: "Fake", value: 1)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !55, file: !3, baseType: !7, size: 64, align: 64, elements: !57)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Repr", scope: !69, file: !3, baseType: !23, size: 8, align: 8, elements: !70)
!69 = !DINamespace(name: "error", scope: !62, file: !3)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "Os", value: 0)
!72 = !DIEnumerator(name: "Simple", value: 1)
!73 = !DIEnumerator(name: "Custom", value: 2)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !69, file: !3, baseType: !23, size: 8, align: 8, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!76 = !DIEnumerator(name: "NotFound", value: 0)
!77 = !DIEnumerator(name: "PermissionDenied", value: 1)
!78 = !DIEnumerator(name: "ConnectionRefused", value: 2)
!79 = !DIEnumerator(name: "ConnectionReset", value: 3)
!80 = !DIEnumerator(name: "ConnectionAborted", value: 4)
!81 = !DIEnumerator(name: "NotConnected", value: 5)
!82 = !DIEnumerator(name: "AddrInUse", value: 6)
!83 = !DIEnumerator(name: "AddrNotAvailable", value: 7)
!84 = !DIEnumerator(name: "BrokenPipe", value: 8)
!85 = !DIEnumerator(name: "AlreadyExists", value: 9)
!86 = !DIEnumerator(name: "WouldBlock", value: 10)
!87 = !DIEnumerator(name: "InvalidInput", value: 11)
!88 = !DIEnumerator(name: "InvalidData", value: 12)
!89 = !DIEnumerator(name: "TimedOut", value: 13)
!90 = !DIEnumerator(name: "WriteZero", value: 14)
!91 = !DIEnumerator(name: "Interrupted", value: 15)
!92 = !DIEnumerator(name: "Other", value: 16)
!93 = !DIEnumerator(name: "UnexpectedEof", value: 17)
!94 = !DIEnumerator(name: "__Nonexhaustive", value: 18)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !96, file: !3, baseType: !7, size: 64, align: 64, elements: !97)
!96 = !DINamespace(name: "result", scope: !56, file: !3)
!97 = !{!98, !99}
!98 = !DIEnumerator(name: "Ok", value: 0)
!99 = !DIEnumerator(name: "Err", value: 1)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocErr", scope: !101, file: !3, baseType: !7, size: 64, align: 64, elements: !103)
!101 = !DINamespace(name: "allocator", scope: !102, file: !3)
!102 = !DINamespace(name: "alloc", scope: null, file: !3)
!103 = !{!104, !105}
!104 = !DIEnumerator(name: "Exhausted", value: 0)
!105 = !DIEnumerator(name: "Unsupported", value: 1)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !96, file: !3, baseType: !23, size: 8, align: 8, elements: !97)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !108, file: !3, baseType: !23, size: 8, align: 8, elements: !111)
!108 = !DINamespace(name: "v1", scope: !109, file: !3)
!109 = !DINamespace(name: "rt", scope: !110, file: !3)
!110 = !DINamespace(name: "fmt", scope: !56, file: !3)
!111 = !{!112, !113, !114, !115}
!112 = !DIEnumerator(name: "Left", value: 0)
!113 = !DIEnumerator(name: "Right", value: 1)
!114 = !DIEnumerator(name: "Center", value: 2)
!115 = !DIEnumerator(name: "Unknown", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Position", scope: !108, file: !3, baseType: !7, size: 64, align: 64, elements: !117)
!117 = !{!118, !119}
!118 = !DIEnumerator(name: "Next", value: 0)
!119 = !DIEnumerator(name: "At", value: 1)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Count", scope: !108, file: !3, baseType: !7, size: 64, align: 64, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIEnumerator(name: "Is", value: 0)
!123 = !DIEnumerator(name: "Param", value: 1)
!124 = !DIEnumerator(name: "NextParam", value: 2)
!125 = !DIEnumerator(name: "Implied", value: 3)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !127, file: !3, baseType: !23, size: 8, align: 8, elements: !129)
!127 = !DINamespace(name: "atomic", scope: !128, file: !3)
!128 = !DINamespace(name: "sync", scope: !56, file: !3)
!129 = !{!130, !131, !132, !133, !134, !135}
!130 = !DIEnumerator(name: "Relaxed", value: 0)
!131 = !DIEnumerator(name: "Release", value: 1)
!132 = !DIEnumerator(name: "Acquire", value: 2)
!133 = !DIEnumerator(name: "AcqRel", value: 3)
!134 = !DIEnumerator(name: "SeqCst", value: 4)
!135 = !DIEnumerator(name: "__Nonexhaustive", value: 5)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Bound", scope: !102, file: !3, baseType: !7, size: 64, align: 64, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIEnumerator(name: "Included", value: 0)
!139 = !DIEnumerator(name: "Excluded", value: 1)
!140 = !DIEnumerator(name: "Unbounded", value: 2)
!141 = !{!0, !10, !14, !18, !26, !32, !40, !42, !44}
!142 = !{i32 2, !"CodeView", i32 1}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = distinct !DISubprogram(name: "index<u8>", linkageName: "_ZN4core5slice8{{impl}}9index<u8>E", scope: !146, file: !145, line: 956, type: !148, isLocal: false, isDefinition: true, scopeLine: 956, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !160, variables: !162)
!145 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Cslice\5Cmod.rs", directory: "")
!146 = !DINamespace(name: "{{impl}}", scope: !147, file: !3)
!147 = !DINamespace(name: "slice", scope: !56, file: !3)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !155, !150}
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "slice<u8>*", file: !3, size: 128, align: 64, elements: !151, identifier: "3d56b4bd09967ef33c47b297d51dadd")
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !150, file: !3, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "const u8*", baseType: !23, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !150, file: !3, baseType: !17, size: 64, align: 64, offset: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !156, file: !3, size: 64, align: 64, elements: !158, identifier: "462c725556dcb1242cb50e057d7b71f2")
!156 = !DINamespace(name: "range", scope: !157, file: !3)
!157 = !DINamespace(name: "ops", scope: !56, file: !3)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !155, file: !3, baseType: !17, size: 64, align: 64)
!160 = !{!161}
!161 = !DITemplateTypeParameter(name: "T", type: !23)
!162 = !{}
!163 = !DILocalVariable(name: "self", arg: 1, scope: !144, file: !164, line: 1, type: !155)
!164 = !DIFile(filename: "src\5Clib.rs", directory: "")
!165 = !DIExpression()
!166 = !DILocation(line: 1, scope: !144)
!167 = !DILocalVariable(name: "slice", arg: 2, scope: !144, file: !164, line: 1, type: !150)
!168 = !DILocation(line: 957, scope: !144)
!169 = !DILocation(line: 958, scope: !144)
!170 = distinct !DISubprogram(name: "index_mut<u8>", linkageName: "_ZN5alloc3vec8{{impl}}13index_mut<u8>E", scope: !172, file: !171, line: 1662, type: !174, isLocal: false, isDefinition: true, scopeLine: 1662, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !160, variables: !162)
!171 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Cliballoc\5Cvec.rs", directory: "")
!172 = !DINamespace(name: "{{impl}}", scope: !173, file: !3)
!173 = !DINamespace(name: "vec", scope: !102, file: !3)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !180, !204}
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "mut slice<u8>*", file: !3, size: 128, align: 64, elements: !177, identifier: "2623b080f88ec33bdf5517b7818bf765")
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !176, file: !3, baseType: !153, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !176, file: !3, baseType: !17, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut alloc::vec::Vec<u8>*", baseType: !181, size: 64, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8>", scope: !173, file: !3, size: 192, align: 64, elements: !182, identifier: "76c64fcb06150e53dadcd324e2ca0643")
!182 = !{!183, !203}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !181, file: !3, baseType: !184, size: 128, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::heap::Heap>", scope: !185, file: !3, size: 128, align: 64, elements: !186, identifier: "9d4757d15200e053c7088bc05fed5cca")
!185 = !DINamespace(name: "raw_vec", scope: !102, file: !3)
!186 = !{!187, !199, !200}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !184, file: !3, baseType: !188, size: 64, align: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !189, file: !3, size: 64, align: 64, elements: !190, identifier: "b7793de57a1540b9d6b4365120108a3c")
!189 = !DINamespace(name: "ptr", scope: !56, file: !3)
!190 = !{!191, !196}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !188, file: !3, baseType: !192, size: 64, align: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<const u8*>", scope: !193, file: !3, size: 64, align: 64, elements: !194, identifier: "830e581f8756f5cf5fc48e5513ba57d2")
!193 = !DINamespace(name: "nonzero", scope: !56, file: !3)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !192, file: !3, baseType: !153, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !188, file: !3, baseType: !197, align: 8, offset: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !198, file: !3, align: 8, elements: !162, identifier: "3a4240d47f6897f8c5532d22cdbbf27a")
!198 = !DINamespace(name: "marker", scope: !56, file: !3)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !184, file: !3, baseType: !17, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !184, file: !3, baseType: !201, align: 8, offset: 128)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Heap", scope: !202, file: !3, align: 8, elements: !162, identifier: "2df087b1d34b42fa2fbd90f9f9dacaff")
!202 = !DINamespace(name: "heap", scope: !102, file: !3)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !181, file: !3, baseType: !17, size: 64, align: 64, offset: 128)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !156, file: !3, align: 8, elements: !162, identifier: "7a1b9b82fe7382f34573c53c12e95631")
!205 = !DILocalVariable(name: "self", arg: 1, scope: !170, file: !164, line: 1, type: !180)
!206 = !DILocation(line: 1, scope: !170)
!207 = !DILocalVariable(name: "_index", arg: 2, scope: !170, file: !164, line: 1, type: !204)
!208 = !DILocation(line: 1663, scope: !170)
!209 = !DILocation(line: 1664, scope: !170)
!210 = distinct !DISubprogram(name: "index<u8>", linkageName: "_ZN5alloc3vec8{{impl}}9index<u8>E", scope: !172, file: !171, line: 1593, type: !211, isLocal: false, isDefinition: true, scopeLine: 1593, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !160, variables: !162)
!211 = !DISubroutineType(types: !212)
!212 = !{!150, !213, !155}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::vec::Vec<u8>*", baseType: !181, size: 64, align: 64)
!214 = !DILocalVariable(name: "self", arg: 1, scope: !210, file: !164, line: 1, type: !213)
!215 = !DILocation(line: 1, scope: !210)
!216 = !DILocalVariable(name: "index", arg: 2, scope: !210, file: !164, line: 1, type: !155)
!217 = !DILocation(line: 1594, scope: !210)
!218 = !DILocation(line: 1595, scope: !210)
!219 = distinct !DISubprogram(name: "from<alloc::vec::Vec<u8>>", linkageName: "_ZN4core7nonzero8{{impl}}25from<alloc::vec::Vec<u8>>E", scope: !221, file: !220, line: 105, type: !222, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !228, variables: !162)
!220 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Cnonzero.rs", directory: "")
!221 = !DINamespace(name: "{{impl}}", scope: !193, file: !3)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !180}
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<const alloc::vec::Vec<u8>*>", scope: !193, file: !3, size: 64, align: 64, elements: !225, identifier: "5f4abe0badcbebeb817bc42b6d05f425")
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !224, file: !3, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "const alloc::vec::Vec<u8>*", baseType: !181, size: 64, align: 64)
!228 = !{!229}
!229 = !DITemplateTypeParameter(name: "T", type: !181)
!230 = !DILocalVariable(name: "reference", arg: 1, scope: !219, file: !164, line: 1, type: !180)
!231 = !DILocation(line: 1, scope: !219)
!232 = !DILocalVariable(name: "ptr", scope: !233, file: !220, line: 106, type: !180, align: 8)
!233 = distinct !DILexicalBlock(scope: !219, file: !220, line: 106, column: 8)
!234 = !DILocation(line: 106, scope: !233)
!235 = !DILocation(line: 107, scope: !233)
!236 = !DILocation(line: 108, scope: !219)
!237 = distinct !DISubprogram(name: "inner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>", linkageName: "_ZN5alloc3arc8{{impl}}149inner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>E", scope: !239, file: !238, line: 501, type: !349, isLocal: false, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !353, variables: !162)
!238 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Cliballoc\5Carc.rs", directory: "")
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>", scope: !240, file: !3, size: 64, align: 64, elements: !241, identifier: "b6347b3aa4ec2521f4fabd73932c865")
!240 = !DINamespace(name: "arc", scope: !102, file: !3)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !239, file: !3, baseType: !243, size: 64, align: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Shared<alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>>", scope: !189, file: !3, size: 64, align: 64, elements: !244, identifier: "cad92574e49e4835e200ac2daabd011c")
!244 = !{!245, !347}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !243, file: !3, baseType: !246, size: 64, align: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<const alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>*>", scope: !193, file: !3, size: 64, align: 64, elements: !247, identifier: "3888eb6e0b67da4da0a9eda26497e159")
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !246, file: !3, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "const alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>*", baseType: !250, size: 64, align: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>", scope: !240, file: !3, size: 640, align: 64, elements: !251, identifier: "4655fcd425ce8dadf4544758b0c0bb44")
!251 = !{!252, !260, !261}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !250, file: !3, baseType: !253, size: 64, align: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !127, file: !3, size: 64, align: 64, elements: !254, identifier: "3545d1c6e564522777d947bb1bac69df")
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !253, file: !3, baseType: !256, size: 64, align: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !257, file: !3, size: 64, align: 64, elements: !258, identifier: "c07e03325cd3511e4a12c0cf9a62c044")
!257 = !DINamespace(name: "cell", scope: !56, file: !3)
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !256, file: !3, baseType: !17, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !250, file: !3, baseType: !253, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !250, file: !3, baseType: !262, size: 512, align: 64, offset: 128)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>", scope: !263, file: !3, size: 512, align: 64, elements: !265, identifier: "49f3c42e8ebe8f5476b10010f16413be")
!263 = !DINamespace(name: "remutex", scope: !264, file: !3)
!264 = !DINamespace(name: "sys_common", scope: !63, file: !3)
!265 = !{!266, !287, !298}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !262, file: !3, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::sys::imp::mutex::ReentrantMutex>", baseType: !268, size: 64, align: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReentrantMutex", scope: !269, file: !3, size: 320, align: 64, elements: !272, identifier: "9f29b1830f77bcd6b23d39cfdc977ffc")
!269 = !DINamespace(name: "mutex", scope: !270, file: !3)
!270 = !DINamespace(name: "imp", scope: !271, file: !3)
!271 = !DINamespace(name: "sys", scope: !63, file: !3)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !268, file: !3, baseType: !274, size: 320, align: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::sys::imp::c::CRITICAL_SECTION>", scope: !257, file: !3, size: 320, align: 64, elements: !275, identifier: "a92856fe652f4a6819e895736a793f8b")
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !274, file: !3, baseType: !277, size: 320, align: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "CRITICAL_SECTION", scope: !278, file: !3, size: 320, align: 64, elements: !279, identifier: "4d3803aab5b0113cd808d836f69c5406")
!278 = !DINamespace(name: "c", scope: !270, file: !3)
!279 = !{!280, !282, !283, !284, !285, !286}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "CriticalSectionDebug", scope: !277, file: !3, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut libc::c_void*", baseType: !49, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "LockCount", scope: !277, file: !3, baseType: !13, size: 32, align: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "RecursionCount", scope: !277, file: !3, baseType: !13, size: 32, align: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "OwningThread", scope: !277, file: !3, baseType: !281, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "LockSemaphore", scope: !277, file: !3, baseType: !281, size: 64, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "SpinCount", scope: !277, file: !3, baseType: !17, size: 64, align: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !262, file: !3, baseType: !288, size: 8, align: 8, offset: 448)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !289, file: !3, size: 8, align: 8, elements: !290, identifier: "c926a15aad72cad8dc252d22b3fa78c")
!289 = !DINamespace(name: "poison", scope: !264, file: !3)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !288, file: !3, baseType: !292, size: 8, align: 8)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !127, file: !3, size: 8, align: 8, elements: !293, identifier: "92be146889dcba8751d211ce1658287c")
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !292, file: !3, baseType: !295, size: 8, align: 8)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !257, file: !3, size: 8, align: 8, elements: !296, identifier: "69adefeabb09105a23ac6d9e0fac5656")
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !295, file: !3, baseType: !23, size: 8, align: 8)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !3, baseType: !299, size: 384, align: 64, offset: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>", scope: !257, file: !3, size: 384, align: 64, elements: !300, identifier: "2b6342fc6942e5d031c0a74d3b29ee53")
!300 = !{!301, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !299, file: !3, baseType: !302, size: 64, align: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !257, file: !3, size: 64, align: 64, elements: !303, identifier: "353bb9b8e62407fb60e61689e1c6e00c")
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !302, file: !3, baseType: !256, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !299, file: !3, baseType: !306, size: 320, align: 64, offset: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>", scope: !257, file: !3, size: 320, align: 64, elements: !307, identifier: "680cf76badf3d02aa21463b9d299b2d6")
!307 = !{!308}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !306, file: !3, baseType: !309, size: 320, align: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>", scope: !310, file: !3, size: 320, align: 64, elements: !311, identifier: "3621e2440aad6049afe94d19cff72e4")
!310 = !DINamespace(name: "buffered", scope: !62, file: !3)
!311 = !{!312, !346}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !309, file: !3, baseType: !313, size: 256, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "BufWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>", scope: !310, file: !3, size: 256, align: 64, elements: !314, identifier: "cf9a79a288c9616888d7b5af1782d99")
!314 = !{!315, !343, !344}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !313, file: !3, baseType: !316, size: 16, align: 8, offset: 192)
!316 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>", scope: !55, file: !3, size: 16, align: 8, elements: !317, identifier: "3e425a1d089582b56db435b6db26e480")
!317 = !{!318, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, scope: !316, file: !3, baseType: !319, size: 8, align: 8)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !55, file: !3, size: 8, align: 8, elements: !320, identifier: "3e425a1d089582b56db435b6db26e480::None")
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !319, file: !3, baseType: !54, size: 8, align: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, scope: !316, file: !3, baseType: !323, size: 16, align: 8)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !55, file: !3, size: 16, align: 8, elements: !324, identifier: "3e425a1d089582b56db435b6db26e480::Some")
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !323, file: !3, baseType: !54, size: 8, align: 8)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !323, file: !3, baseType: !327, size: 8, align: 8, offset: 8)
!327 = !DICompositeType(tag: DW_TAG_union_type, name: "Maybe<std::io::stdio::StdoutRaw>", scope: !61, file: !3, size: 8, align: 8, elements: !328, identifier: "54d12050584d0427a7c52ca11eafd3da")
!328 = !{!329, !339}
!329 = !DIDerivedType(tag: DW_TAG_member, scope: !327, file: !3, baseType: !330, size: 8, align: 8)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Real", scope: !61, file: !3, size: 8, align: 8, elements: !331, identifier: "54d12050584d0427a7c52ca11eafd3da::Real")
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !330, file: !3, baseType: !60, size: 8, align: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !330, file: !3, baseType: !334, align: 8, offset: 8)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "StdoutRaw", scope: !61, file: !3, align: 8, elements: !335, identifier: "d65f8cc9cad3224ab562608687472f2f")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !334, file: !3, baseType: !337, align: 8)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stdout", scope: !338, file: !3, align: 8, elements: !162, identifier: "248bbd1b163c10b79f0c96a1c7457fdc")
!338 = !DINamespace(name: "stdio", scope: !270, file: !3)
!339 = !DIDerivedType(tag: DW_TAG_member, scope: !327, file: !3, baseType: !340, size: 8, align: 8)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fake", scope: !61, file: !3, size: 8, align: 8, elements: !341, identifier: "54d12050584d0427a7c52ca11eafd3da::Fake")
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !340, file: !3, baseType: !60, size: 8, align: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !313, file: !3, baseType: !181, size: 192, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !313, file: !3, baseType: !345, size: 8, align: 8, offset: 208)
!345 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "need_flush", scope: !309, file: !3, baseType: !345, size: 8, align: 8, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !243, file: !3, baseType: !348, align: 8, offset: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>>", scope: !198, file: !3, align: 8, elements: !162, identifier: "5d2e3a3518435c7d9f24bca5fa5b773d")
!349 = !DISubroutineType(types: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>*", baseType: !250, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::arc::Arc<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>*", baseType: !239, size: 64, align: 64)
!353 = !{!354}
!354 = !DITemplateTypeParameter(name: "T", type: !262)
!355 = !DILocalVariable(name: "self", arg: 1, scope: !237, file: !164, line: 1, type: !352)
!356 = !DILocation(line: 1, scope: !237)
!357 = !DILocation(line: 507, scope: !358)
!358 = distinct !DILexicalBlock(scope: !237, file: !238, line: 507, column: 8)
!359 = !DILocation(line: 508, scope: !237)
!360 = distinct !DISubprogram(name: "drop_slow<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>", linkageName: "_ZN5alloc3arc8{{impl}}153drop_slow<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>E", scope: !239, file: !238, line: 512, type: !361, isLocal: false, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !353, variables: !162)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut alloc::arc::Arc<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>*", baseType: !239, size: 64, align: 64)
!364 = !DILocalVariable(name: "self", arg: 1, scope: !360, file: !164, line: 1, type: !363)
!365 = !DILocation(line: 1, scope: !360)
!366 = !DILocalVariable(name: "ptr", scope: !367, file: !238, line: 513, type: !368, align: 8)
!367 = distinct !DILexicalBlock(scope: !360, file: !238, line: 513, column: 8)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>*", baseType: !250, size: 64, align: 64)
!369 = !DILocation(line: 513, scope: !367)
!370 = !DILocation(line: 517, scope: !367)
!371 = !DILocation(line: 519, scope: !367)
!372 = !DILocation(line: 520, scope: !367)
!373 = !DILocation(line: 521, scope: !367)
!374 = !DILocation(line: 523, scope: !360)
!375 = distinct !DISubprogram(name: "with_capacity<u8>", linkageName: "_ZN5alloc3vec8{{impl}}17with_capacity<u8>E", scope: !181, file: !171, line: 357, type: !376, isLocal: false, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !160, variables: !162)
!376 = !DISubroutineType(types: !377)
!377 = !{!181, !17}
!378 = !DILocalVariable(name: "capacity", arg: 1, scope: !375, file: !164, line: 1, type: !17)
!379 = !DILocation(line: 1, scope: !375)
!380 = !DILocation(line: 359, scope: !375)
!381 = !DILocation(line: 358, scope: !375)
!382 = !DILocation(line: 362, scope: !375)
!383 = distinct !DISubprogram(name: "len<u8>", linkageName: "_ZN5alloc3vec8{{impl}}7len<u8>E", scope: !181, file: !171, line: 1160, type: !384, isLocal: false, isDefinition: true, scopeLine: 1160, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !160, variables: !162)
!384 = !DISubroutineType(types: !385)
!385 = !{!17, !213}
!386 = !DILocalVariable(name: "self", arg: 1, scope: !383, file: !164, line: 1, type: !213)
!387 = !DILocation(line: 1, scope: !383)
!388 = !DILocation(line: 1161, scope: !383)
!389 = !DILocation(line: 1162, scope: !383)
!390 = distinct !DISubprogram(name: "drain<u8,core::ops::range::RangeTo<usize>>", linkageName: "_ZN5alloc3vec8{{impl}}42drain<u8,core::ops::range::RangeTo<usize>>E", scope: !181, file: !171, line: 1086, type: !391, isLocal: false, isDefinition: true, scopeLine: 1086, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !413, variables: !162)
!391 = !DISubroutineType(types: !392)
!392 = !{!393, !180, !410}
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Drain<u8>", scope: !173, file: !3, size: 320, align: 64, elements: !394, identifier: "e59653833426634d5f25c8ac6c416039")
!394 = !{!395, !396, !397, !404}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tail_start", scope: !393, file: !3, baseType: !17, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tail_len", scope: !393, file: !3, baseType: !17, size: 64, align: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !393, file: !3, baseType: !398, size: 128, align: 64, offset: 128)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !147, file: !3, size: 128, align: 64, elements: !399, identifier: "431f9d7f7a607eb1b1a7436105e50dab")
!399 = !{!400, !401, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !398, file: !3, baseType: !153, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !398, file: !3, baseType: !153, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !398, file: !3, baseType: !403, align: 8, offset: 128)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8*>", scope: !198, file: !3, align: 8, elements: !162, identifier: "25f96d4067b2e9ead06e7159a3e90e33")
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !393, file: !3, baseType: !405, size: 64, align: 64, offset: 256)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Shared<alloc::vec::Vec<u8>>", scope: !189, file: !3, size: 64, align: 64, elements: !406, identifier: "6157f2c2888c123c2b9defc65cc3a892")
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !405, file: !3, baseType: !224, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !405, file: !3, baseType: !409, align: 8, offset: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::vec::Vec<u8>>", scope: !198, file: !3, align: 8, elements: !162, identifier: "af2849582d15903bf303d152dab4a7d0")
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !156, file: !3, size: 64, align: 64, elements: !411, identifier: "13344bd2bc9e09a5762a0fb70c0b69e2")
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !410, file: !3, baseType: !17, size: 64, align: 64)
!413 = !{!161, !414}
!414 = !DITemplateTypeParameter(name: "R", type: !410)
!415 = !DILocalVariable(name: "self", arg: 1, scope: !390, file: !164, line: 1, type: !180)
!416 = !DILocation(line: 1, scope: !390)
!417 = !DILocalVariable(name: "range", arg: 2, scope: !390, file: !164, line: 1, type: !410)
!418 = !DILocalVariable(name: "len", scope: !419, file: !171, line: 1099, type: !17, align: 8)
!419 = distinct !DILexicalBlock(scope: !390, file: !171, line: 1099, column: 8)
!420 = !DILocation(line: 1099, scope: !419)
!421 = !DILocalVariable(name: "start", scope: !422, file: !171, line: 1100, type: !17, align: 8)
!422 = distinct !DILexicalBlock(scope: !419, file: !171, line: 1100, column: 8)
!423 = !DILocation(line: 1100, scope: !422)
!424 = !DILocalVariable(name: "n", scope: !425, file: !171, line: 1101, type: !17, align: 8)
!425 = distinct !DILexicalBlock(scope: !422, file: !171, line: 1101, column: 28)
!426 = !DILocation(line: 1101, scope: !425)
!427 = !DILocalVariable(name: "n", scope: !428, file: !171, line: 1102, type: !17, align: 8)
!428 = distinct !DILexicalBlock(scope: !425, file: !171, line: 1102, column: 28)
!429 = !DILocation(line: 1102, scope: !428)
!430 = !DILocalVariable(name: "end", scope: !431, file: !171, line: 1105, type: !17, align: 8)
!431 = distinct !DILexicalBlock(scope: !422, file: !171, line: 1105, column: 8)
!432 = !DILocation(line: 1105, scope: !431)
!433 = !DILocalVariable(name: "n", scope: !434, file: !171, line: 1106, type: !17, align: 8)
!434 = distinct !DILexicalBlock(scope: !431, file: !171, line: 1106, column: 28)
!435 = !DILocation(line: 1106, scope: !434)
!436 = !DILocalVariable(name: "n", scope: !437, file: !171, line: 1107, type: !17, align: 8)
!437 = distinct !DILexicalBlock(scope: !434, file: !171, line: 1107, column: 28)
!438 = !DILocation(line: 1107, scope: !437)
!439 = !DILocalVariable(name: "range_slice", scope: !440, file: !171, line: 1118, type: !176, align: 8)
!440 = distinct !DILexicalBlock(scope: !431, file: !171, line: 1118, column: 12)
!441 = !DILocation(line: 1118, scope: !440)
!442 = !DILocation(line: 1086, scope: !390)
!443 = !DILocation(line: 1127, scope: !390)
!444 = !DILocation(line: 1101, scope: !428)
!445 = !{i64 0, i64 3}
!446 = !DILocation(line: 1103, scope: !428)
!447 = !DILocation(line: 1100, scope: !428)
!448 = !DILocation(line: 1106, scope: !437)
!449 = !DILocation(line: 1108, scope: !437)
!450 = !DILocation(line: 1105, scope: !437)
!451 = !DILocation(line: 1110, scope: !431)
!452 = !DILocation(line: 2, scope: !453)
!453 = !DILexicalBlockFile(scope: !431, file: !454, discriminator: 0)
!454 = !DIFile(filename: "C:\5Cprojects\5Crust\5C<assert macros>", directory: "")
!455 = !DILocation(line: 4, scope: !456)
!456 = !DILexicalBlockFile(scope: !431, file: !457, discriminator: 0)
!457 = !DIFile(filename: "C:\5Cprojects\5Crust\5C<panic macros>", directory: "")
!458 = !DILocation(line: 3, scope: !456)
!459 = !DILocation(line: 1111, scope: !431)
!460 = !DILocation(line: 1115, scope: !431)
!461 = !DILocation(line: 1119, scope: !440)
!462 = !DILocation(line: 1121, scope: !440)
!463 = !DILocation(line: 1122, scope: !440)
!464 = !DILocation(line: 1123, scope: !440)
!465 = !DILocation(line: 1124, scope: !440)
!466 = !DILocation(line: 1120, scope: !440)
!467 = distinct !DISubprogram(name: "set_len<u8>", linkageName: "_ZN5alloc3vec8{{impl}}11set_len<u8>E", scope: !181, file: !171, line: 677, type: !468, isLocal: false, isDefinition: true, scopeLine: 677, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !160, variables: !162)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !180, !17}
!470 = !DILocalVariable(name: "self", arg: 1, scope: !467, file: !164, line: 1, type: !180)
!471 = !DILocation(line: 1, scope: !467)
!472 = !DILocalVariable(name: "len", arg: 2, scope: !467, file: !164, line: 1, type: !17)
!473 = !DILocation(line: 678, scope: !467)
!474 = !DILocation(line: 679, scope: !467)
!475 = distinct !DISubprogram(name: "as_mut<alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>>", linkageName: "_ZN4core3ptr8{{impl}}172as_mut<alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>>E", scope: !243, file: !476, line: 2506, type: !477, isLocal: false, isDefinition: true, scopeLine: 2506, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !480, variables: !162)
!476 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Cptr.rs", directory: "")
!477 = !DISubroutineType(types: !478)
!478 = !{!368, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut core::ptr::Shared<alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>>*", baseType: !243, size: 64, align: 64)
!480 = !{!481}
!481 = !DITemplateTypeParameter(name: "T", type: !250)
!482 = !DILocalVariable(name: "self", arg: 1, scope: !475, file: !164, line: 1, type: !479)
!483 = !DILocation(line: 1, scope: !475)
!484 = !DILocation(line: 2507, scope: !475)
!485 = !DILocation(line: 2508, scope: !475)
!486 = distinct !DISubprogram(name: "as_mut<alloc::vec::Vec<u8>>", linkageName: "_ZN4core3ptr8{{impl}}27as_mut<alloc::vec::Vec<u8>>E", scope: !405, file: !476, line: 2506, type: !487, isLocal: false, isDefinition: true, scopeLine: 2506, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !228, variables: !162)
!487 = !DISubroutineType(types: !488)
!488 = !{!180, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut core::ptr::Shared<alloc::vec::Vec<u8>>*", baseType: !405, size: 64, align: 64)
!490 = !DILocalVariable(name: "self", arg: 1, scope: !486, file: !164, line: 1, type: !489)
!491 = !DILocation(line: 1, scope: !486)
!492 = !DILocation(line: 2507, scope: !486)
!493 = !DILocation(line: 2508, scope: !486)
!494 = distinct !DISubprogram(name: "as_ptr<alloc::vec::Vec<u8>>", linkageName: "_ZN4core3ptr8{{impl}}27as_ptr<alloc::vec::Vec<u8>>E", scope: !405, file: !476, line: 2488, type: !495, isLocal: false, isDefinition: true, scopeLine: 2488, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !228, variables: !162)
!495 = !DISubroutineType(types: !496)
!496 = !{!180, !405}
!497 = !DILocalVariable(name: "self", arg: 1, scope: !494, file: !164, line: 1, type: !405)
!498 = !DILocation(line: 1, scope: !494)
!499 = !DILocation(line: 2489, scope: !494)
!500 = !DILocation(line: 2490, scope: !494)
!501 = distinct !DISubprogram(name: "as_ptr<alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>>", linkageName: "_ZN4core3ptr8{{impl}}172as_ptr<alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>>E", scope: !243, file: !476, line: 2488, type: !502, isLocal: false, isDefinition: true, scopeLine: 2488, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !480, variables: !162)
!502 = !DISubroutineType(types: !503)
!503 = !{!368, !243}
!504 = !DILocalVariable(name: "self", arg: 1, scope: !501, file: !164, line: 1, type: !243)
!505 = !DILocation(line: 1, scope: !501)
!506 = !DILocation(line: 2489, scope: !501)
!507 = !DILocation(line: 2490, scope: !501)
!508 = distinct !DISubprogram(name: "as_ref<alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>>", linkageName: "_ZN4core3ptr8{{impl}}172as_ref<alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>>E", scope: !243, file: !476, line: 2497, type: !509, isLocal: false, isDefinition: true, scopeLine: 2497, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !480, variables: !162)
!509 = !DISubroutineType(types: !510)
!510 = !{!351, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "core::ptr::Shared<alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>>*", baseType: !243, size: 64, align: 64)
!512 = !DILocalVariable(name: "self", arg: 1, scope: !508, file: !164, line: 1, type: !511)
!513 = !DILocation(line: 1, scope: !508)
!514 = !DILocation(line: 2498, scope: !508)
!515 = !DILocation(line: 2499, scope: !508)
!516 = distinct !DISubprogram(name: "new_unchecked<u8>", linkageName: "_ZN4core3ptr8{{impl}}17new_unchecked<u8>E", scope: !188, file: !476, line: 2343, type: !517, isLocal: false, isDefinition: true, scopeLine: 2343, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !160, variables: !162)
!517 = !DISubroutineType(types: !518)
!518 = !{!188, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut u8*", baseType: !23, size: 64, align: 64)
!520 = !DILocalVariable(name: "ptr", arg: 1, scope: !516, file: !164, line: 1, type: !519)
!521 = !DILocation(line: 1, scope: !516)
!522 = !DILocation(line: 2344, scope: !516)
!523 = !DILocation(line: 2345, scope: !516)
!524 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8{{impl}}10as_ptr<u8>E", scope: !188, file: !476, line: 2353, type: !525, isLocal: false, isDefinition: true, scopeLine: 2353, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !160, variables: !162)
!525 = !DISubroutineType(types: !526)
!526 = !{!519, !188}
!527 = !DILocalVariable(name: "self", arg: 1, scope: !524, file: !164, line: 1, type: !188)
!528 = !DILocation(line: 1, scope: !524)
!529 = !DILocation(line: 2354, scope: !524)
!530 = !DILocation(line: 2355, scope: !524)
!531 = distinct !DISubprogram(name: "map<u8*,u8,closure>", linkageName: "_ZN4core6option8{{impl}}19map<u8*,u8,closure>E", scope: !533, file: !532, line: 396, type: !540, isLocal: false, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !554, variables: !162)
!532 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Coption.rs", directory: "")
!533 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<u8*>", scope: !55, file: !3, size: 64, align: 64, elements: !534, identifier: "fa1afad4af65f808b2e5a58f60b1b952")
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENCODED$ENUM$0$None", scope: !533, file: !3, baseType: !536, size: 64, align: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !55, file: !3, size: 64, align: 64, elements: !537, identifier: "fa1afad4af65f808b2e5a58f60b1b952::Some")
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !536, file: !3, baseType: !539, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "u8*", baseType: !23, size: 64, align: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!542, !533, !553}
!542 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<u8>", scope: !55, file: !3, size: 16, align: 8, elements: !543, identifier: "90dca8b0f61b579e4b56c3f8243d6bd0")
!543 = !{!544, !548}
!544 = !DIDerivedType(tag: DW_TAG_member, scope: !542, file: !3, baseType: !545, size: 8, align: 8)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !55, file: !3, size: 8, align: 8, elements: !546, identifier: "90dca8b0f61b579e4b56c3f8243d6bd0::None")
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !545, file: !3, baseType: !54, size: 8, align: 8)
!548 = !DIDerivedType(tag: DW_TAG_member, scope: !542, file: !3, baseType: !549, size: 16, align: 8)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !55, file: !3, size: 16, align: 8, elements: !550, identifier: "90dca8b0f61b579e4b56c3f8243d6bd0::Some")
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !549, file: !3, baseType: !54, size: 8, align: 8)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !549, file: !3, baseType: !23, size: 8, align: 8, offset: 8)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure", file: !3, align: 8, elements: !162, identifier: "86c72378a7bba1aeaaaca59e11851b84")
!554 = !{!555, !556, !557}
!555 = !DITemplateTypeParameter(name: "T", type: !539)
!556 = !DITemplateTypeParameter(name: "U", type: !23)
!557 = !DITemplateTypeParameter(name: "F", type: !553)
!558 = !DILocalVariable(name: "self", arg: 1, scope: !531, file: !164, line: 1, type: !533)
!559 = !DILocation(line: 1, scope: !531)
!560 = !DILocalVariable(name: "f", arg: 2, scope: !531, file: !164, line: 1, type: !553)
!561 = !DILocalVariable(name: "x", scope: !562, file: !532, line: 398, type: !539, align: 8)
!562 = distinct !DILexicalBlock(scope: !531, file: !532, line: 398, column: 23)
!563 = !DILocation(line: 398, scope: !562)
!564 = !DILocation(line: 399, scope: !562)
!565 = !DILocation(line: 397, scope: !562)
!566 = !DILocation(line: 401, scope: !531)
!567 = !DILocation(line: 396, scope: !531)
!568 = !DILocation(line: 400, scope: !531)
!569 = !{i8 0, i8 2}
!570 = distinct !DISubprogram(name: "as_mut<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>", linkageName: "_ZN4core6option8{{impl}}56as_mut<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>E", scope: !316, file: !532, line: 265, type: !571, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !581, variables: !162)
!571 = !DISubroutineType(types: !572)
!572 = !{!573, !580}
!573 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<mut std::io::stdio::Maybe<std::io::stdio::StdoutRaw>*>", scope: !55, file: !3, size: 64, align: 64, elements: !574, identifier: "3a9c3c1b7311d2b4f075a5f13e4fb71d")
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENCODED$ENUM$0$None", scope: !573, file: !3, baseType: !576, size: 64, align: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !55, file: !3, size: 64, align: 64, elements: !577, identifier: "3a9c3c1b7311d2b4f075a5f13e4fb71d::Some")
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !576, file: !3, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut std::io::stdio::Maybe<std::io::stdio::StdoutRaw>*", baseType: !327, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut core::option::Option<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>*", baseType: !316, size: 64, align: 64)
!581 = !{!582}
!582 = !DITemplateTypeParameter(name: "T", type: !327)
!583 = !DILocalVariable(name: "self", arg: 1, scope: !570, file: !164, line: 1, type: !580)
!584 = !DILocation(line: 1, scope: !570)
!585 = !DILocalVariable(name: "x", scope: !586, file: !532, line: 267, type: !579, align: 8)
!586 = distinct !DILexicalBlock(scope: !570, file: !532, line: 267, column: 31)
!587 = !DILocation(line: 267, scope: !586)
!588 = !DILocation(line: 268, scope: !586)
!589 = !DILocation(line: 266, scope: !586)
!590 = !DILocation(line: 270, scope: !570)
!591 = distinct !DISubprogram(name: "expect<usize>", linkageName: "_ZN4core6option8{{impl}}13expect<usize>E", scope: !592, file: !532, line: 299, type: !603, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !609, variables: !162)
!592 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<usize>", scope: !55, file: !3, size: 128, align: 64, elements: !593, identifier: "e69128fc1c9050baf4b9e062bc1c9d60")
!593 = !{!594, !598}
!594 = !DIDerivedType(tag: DW_TAG_member, scope: !592, file: !3, baseType: !595, size: 64, align: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !55, file: !3, size: 64, align: 64, elements: !596, identifier: "e69128fc1c9050baf4b9e062bc1c9d60::None")
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !595, file: !3, baseType: !67, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, scope: !592, file: !3, baseType: !599, size: 128, align: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !55, file: !3, size: 128, align: 64, elements: !600, identifier: "e69128fc1c9050baf4b9e062bc1c9d60::Some")
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !599, file: !3, baseType: !67, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !599, file: !3, baseType: !17, size: 64, align: 64, offset: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!17, !592, !605}
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "str*", file: !3, size: 128, align: 64, elements: !606, identifier: "12a74f968388ec87446426880567efa3")
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !605, file: !3, baseType: !153, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !605, file: !3, baseType: !17, size: 64, align: 64, offset: 64)
!609 = !{!610}
!610 = !DITemplateTypeParameter(name: "T", type: !17)
!611 = !DILocation(line: 1, scope: !591)
!612 = !DILocalVariable(name: "self", arg: 1, scope: !591, file: !164, line: 1, type: !592)
!613 = !DIExpression(DW_OP_deref)
!614 = !DILocalVariable(name: "msg", arg: 2, scope: !591, file: !164, line: 1, type: !605)
!615 = !DILocalVariable(name: "val", scope: !616, file: !532, line: 301, type: !17, align: 8)
!616 = distinct !DILexicalBlock(scope: !591, file: !532, line: 301, column: 25)
!617 = !DILocation(line: 301, scope: !616)
!618 = !{i64 0, i64 2}
!619 = !DILocation(line: 302, scope: !616)
!620 = !DILocation(line: 304, scope: !591)
!621 = !DILocation(line: 299, scope: !591)
!622 = distinct !DISubprogram(name: "unwrap<mut std::io::stdio::Maybe<std::io::stdio::StdoutRaw>*>", linkageName: "_ZN4core6option8{{impl}}61unwrap<mut std::io::stdio::Maybe<std::io::stdio::StdoutRaw>*>E", scope: !573, file: !532, line: 332, type: !623, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !625, variables: !162)
!623 = !DISubroutineType(types: !624)
!624 = !{!579, !573}
!625 = !{!626}
!626 = !DITemplateTypeParameter(name: "T", type: !579)
!627 = !DILocalVariable(name: "self", arg: 1, scope: !622, file: !164, line: 1, type: !573)
!628 = !DILocation(line: 1, scope: !622)
!629 = !DILocalVariable(name: "val", scope: !630, file: !532, line: 334, type: !579, align: 8)
!630 = distinct !DILexicalBlock(scope: !622, file: !532, line: 334, column: 25)
!631 = !DILocation(line: 334, scope: !630)
!632 = !DILocation(line: 20, scope: !633)
!633 = !DILexicalBlockFile(scope: !630, file: !634, discriminator: 0)
!634 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Cmacros.rs", directory: "")
!635 = !DILocation(line: 337, scope: !622)
!636 = !DILocation(line: 332, scope: !622)
!637 = distinct !DISubprogram(name: "unwrap<alloc::allocator::Layout>", linkageName: "_ZN4core6option8{{impl}}32unwrap<alloc::allocator::Layout>E", scope: !638, file: !532, line: 332, type: !653, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !655, variables: !162)
!638 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<alloc::allocator::Layout>", scope: !55, file: !3, size: 192, align: 64, elements: !639, identifier: "e85964ee26746d4588d04c03f4da16a9")
!639 = !{!640, !644}
!640 = !DIDerivedType(tag: DW_TAG_member, scope: !638, file: !3, baseType: !641, size: 64, align: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !55, file: !3, size: 64, align: 64, elements: !642, identifier: "e85964ee26746d4588d04c03f4da16a9::None")
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !641, file: !3, baseType: !67, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, scope: !638, file: !3, baseType: !645, size: 192, align: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !55, file: !3, size: 192, align: 64, elements: !646, identifier: "e85964ee26746d4588d04c03f4da16a9::Some")
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !645, file: !3, baseType: !67, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !645, file: !3, baseType: !649, size: 128, align: 64, offset: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !101, file: !3, size: 128, align: 64, elements: !650, identifier: "a9989bea6e1525d14ef427ce37cf48d4")
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !649, file: !3, baseType: !17, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !649, file: !3, baseType: !17, size: 64, align: 64, offset: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!649, !638}
!655 = !{!656}
!656 = !DITemplateTypeParameter(name: "T", type: !649)
!657 = !DILocation(line: 1, scope: !637)
!658 = !DILocalVariable(name: "self", arg: 1, scope: !637, file: !164, line: 1, type: !638)
!659 = !DILocalVariable(name: "val", scope: !660, file: !532, line: 334, type: !649, align: 8)
!660 = distinct !DILexicalBlock(scope: !637, file: !532, line: 334, column: 25)
!661 = !DILocation(line: 334, scope: !660)
!662 = !DILocation(line: 20, scope: !663)
!663 = !DILexicalBlockFile(scope: !660, file: !634, discriminator: 0)
!664 = !DILocation(line: 337, scope: !637)
!665 = !DILocation(line: 332, scope: !637)
!666 = distinct !DISubprogram(name: "is_some<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>", linkageName: "_ZN4core6option8{{impl}}57is_some<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>E", scope: !316, file: !532, line: 192, type: !667, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !581, variables: !162)
!667 = !DISubroutineType(types: !668)
!668 = !{!345, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "core::option::Option<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>*", baseType: !316, size: 64, align: 64)
!670 = !DILocalVariable(name: "self", arg: 1, scope: !666, file: !164, line: 1, type: !669)
!671 = !DILocation(line: 1, scope: !666)
!672 = !DILocation(line: 194, scope: !666)
!673 = !DILocation(line: 193, scope: !666)
!674 = !DILocation(line: 195, scope: !666)
!675 = !DILocation(line: 197, scope: !666)
!676 = distinct !DISubprogram(name: "new<str*>", linkageName: "_ZN3std2io5error8{{impl}}9new<str*>E", scope: !678, file: !677, line: 246, type: !708, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !710, variables: !162)
!677 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibstd\5Cio\5Cerror.rs", directory: "")
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !69, file: !3, size: 128, align: 64, elements: !679, identifier: "c3f83fc126fc92c9bfb7b91c4958a970")
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !678, file: !3, baseType: !681, size: 128, align: 64)
!681 = !DICompositeType(tag: DW_TAG_union_type, name: "Repr", scope: !69, file: !3, size: 128, align: 64, elements: !682, identifier: "faca0826134900294b6989a46409ca8")
!682 = !{!683, !688, !693}
!683 = !DIDerivedType(tag: DW_TAG_member, scope: !681, file: !3, baseType: !684, size: 64, align: 32)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !69, file: !3, size: 64, align: 32, elements: !685, identifier: "faca0826134900294b6989a46409ca8::Os")
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !684, file: !3, baseType: !68, size: 8, align: 8)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !684, file: !3, baseType: !13, size: 32, align: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, scope: !681, file: !3, baseType: !689, size: 16, align: 8)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !69, file: !3, size: 16, align: 8, elements: !690, identifier: "faca0826134900294b6989a46409ca8::Simple")
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !689, file: !3, baseType: !68, size: 8, align: 8)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !689, file: !3, baseType: !74, size: 8, align: 8, offset: 8)
!693 = !DIDerivedType(tag: DW_TAG_member, scope: !681, file: !3, baseType: !694, size: 128, align: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !69, file: !3, size: 128, align: 64, elements: !695, identifier: "faca0826134900294b6989a46409ca8::Custom")
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !694, file: !3, baseType: !68, size: 8, align: 8)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !694, file: !3, baseType: !698, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::io::error::Custom>", baseType: !699, size: 64, align: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !69, file: !3, size: 192, align: 64, elements: !700, identifier: "4dc66659537ea65c31f6d34e532c84ff")
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !699, file: !3, baseType: !74, size: 8, align: 8)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !699, file: !3, baseType: !703, size: 128, align: 64, offset: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<Error>", scope: !704, file: !3, size: 128, align: 64, elements: !705, identifier: "c823e19a3afd9868c11dc538cf13db55")
!704 = !DINamespace(name: "error", scope: !63, file: !3)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !703, file: !3, baseType: !153, size: 64, align: 64, flags: DIFlagArtificial)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !703, file: !3, baseType: !153, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!708 = !DISubroutineType(types: !709)
!709 = !{!678, !74, !605}
!710 = !{!711}
!711 = !DITemplateTypeParameter(name: "E", type: !605)
!712 = !DILocalVariable(name: "kind", arg: 1, scope: !676, file: !164, line: 1, type: !74)
!713 = !DILocation(line: 1, scope: !676)
!714 = !DILocalVariable(name: "error", arg: 2, scope: !676, file: !164, line: 1, type: !605)
!715 = !DILocation(line: 249, scope: !676)
!716 = !DILocation(line: 250, scope: !676)
!717 = distinct !DISubprogram(name: "handle_ebadf<usize>", linkageName: "_ZN3std2io5stdio19handle_ebadf<usize>E", scope: !61, file: !718, line: 123, type: !719, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !609, variables: !162)
!718 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibstd\5Cio\5Cstdio.rs", directory: "")
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !721, !17}
!721 = !DICompositeType(tag: DW_TAG_union_type, name: "Result<usize, std::io::error::Error>", scope: !96, file: !3, size: 192, align: 64, elements: !722, identifier: "e9b1d32ca97cc1f6c505f9dd7d6ff702")
!722 = !{!723, !728}
!723 = !DIDerivedType(tag: DW_TAG_member, scope: !721, file: !3, baseType: !724, size: 128, align: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !96, file: !3, size: 128, align: 64, elements: !725, identifier: "e9b1d32ca97cc1f6c505f9dd7d6ff702::Ok")
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !724, file: !3, baseType: !95, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !724, file: !3, baseType: !17, size: 64, align: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, scope: !721, file: !3, baseType: !729, size: 192, align: 64)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !96, file: !3, size: 192, align: 64, elements: !730, identifier: "e9b1d32ca97cc1f6c505f9dd7d6ff702::Err")
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !729, file: !3, baseType: !95, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !729, file: !3, baseType: !678, size: 128, align: 64, offset: 64)
!733 = !DILocation(line: 1, scope: !717)
!734 = !DILocalVariable(name: "r", arg: 1, scope: !717, file: !164, line: 1, type: !721)
!735 = !DILocalVariable(name: "default", arg: 2, scope: !717, file: !164, line: 1, type: !17)
!736 = !DILocalVariable(name: "e", scope: !737, file: !718, line: 125, type: !738, align: 8)
!737 = distinct !DILexicalBlock(scope: !717, file: !718, line: 125, column: 44)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "std::io::error::Error*", baseType: !678, size: 64, align: 64)
!739 = !DILocation(line: 125, scope: !737)
!740 = !DILocalVariable(name: "r", scope: !741, file: !718, line: 126, type: !721, align: 8)
!741 = distinct !DILexicalBlock(scope: !737, file: !718, line: 126, column: 13)
!742 = !DILocation(line: 126, scope: !741)
!743 = !DILocation(line: 125, scope: !741)
!744 = !DILocation(line: 124, scope: !741)
!745 = !DILocation(line: 123, scope: !717)
!746 = !DILocation(line: 128, scope: !717)
!747 = distinct !DISubprogram(name: "with_capacity<u8>", linkageName: "_ZN5alloc7raw_vec8{{impl}}17with_capacity<u8>E", scope: !184, file: !748, line: 140, type: !749, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !160, variables: !162)
!748 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Cliballoc\5Craw_vec.rs", directory: "")
!749 = !DISubroutineType(types: !750)
!750 = !{!184, !17}
!751 = !DILocalVariable(name: "cap", arg: 1, scope: !747, file: !164, line: 1, type: !17)
!752 = !DILocation(line: 1, scope: !747)
!753 = !DILocation(line: 141, scope: !747)
!754 = !DILocation(line: 142, scope: !747)
!755 = distinct !DISubprogram(name: "with_capacity_zeroed<u8>", linkageName: "_ZN5alloc7raw_vec8{{impl}}24with_capacity_zeroed<u8>E", scope: !184, file: !748, line: 146, type: !749, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !160, variables: !162)
!756 = !DILocalVariable(name: "cap", arg: 1, scope: !755, file: !164, line: 1, type: !17)
!757 = !DILocation(line: 1, scope: !755)
!758 = !DILocation(line: 147, scope: !755)
!759 = !DILocation(line: 148, scope: !755)
!760 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell8{{impl}}10get<usize>E", scope: !256, file: !761, line: 1241, type: !762, isLocal: false, isDefinition: true, scopeLine: 1241, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !609, variables: !162)
!761 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Ccell.rs", directory: "")
!762 = !DISubroutineType(types: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut usize*", baseType: !17, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "core::cell::UnsafeCell<usize>*", baseType: !256, size: 64, align: 64)
!766 = !DILocalVariable(name: "self", arg: 1, scope: !760, file: !164, line: 1, type: !765)
!767 = !DILocation(line: 1, scope: !760)
!768 = !DILocation(line: 1242, scope: !760)
!769 = !DILocation(line: 1243, scope: !760)
!770 = distinct !DISubprogram(name: "new_unchecked<const u8*>", linkageName: "_ZN4core7nonzero8{{impl}}24new_unchecked<const u8*>E", scope: !192, file: !220, line: 76, type: !771, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !773, variables: !162)
!771 = !DISubroutineType(types: !772)
!772 = !{!192, !153}
!773 = !{!774}
!774 = !DITemplateTypeParameter(name: "T", type: !153)
!775 = !DILocalVariable(name: "inner", arg: 1, scope: !770, file: !164, line: 1, type: !153)
!776 = !DILocation(line: 1, scope: !770)
!777 = !DILocation(line: 77, scope: !770)
!778 = !DILocation(line: 78, scope: !770)
!779 = distinct !DISubprogram(name: "get<const alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>*>", linkageName: "_ZN4core7nonzero8{{impl}}176get<const alloc::arc::ArcInner<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::LineWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>>>>*>E", scope: !246, file: !220, line: 91, type: !780, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !782, variables: !162)
!780 = !DISubroutineType(types: !781)
!781 = !{!249, !246}
!782 = !{!783}
!783 = !DITemplateTypeParameter(name: "T", type: !249)
!784 = !DILocalVariable(name: "self", arg: 1, scope: !779, file: !164, line: 1, type: !246)
!785 = !DILocation(line: 1, scope: !779)
!786 = !DILocation(line: 92, scope: !779)
!787 = !DILocation(line: 93, scope: !779)
!788 = distinct !DISubprogram(name: "get<const alloc::vec::Vec<u8>*>", linkageName: "_ZN4core7nonzero8{{impl}}31get<const alloc::vec::Vec<u8>*>E", scope: !224, file: !220, line: 91, type: !789, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !791, variables: !162)
!789 = !DISubroutineType(types: !790)
!790 = !{!227, !224}
!791 = !{!792}
!792 = !DITemplateTypeParameter(name: "T", type: !227)
!793 = !DILocalVariable(name: "self", arg: 1, scope: !788, file: !164, line: 1, type: !224)
!794 = !DILocation(line: 1, scope: !788)
!795 = !DILocation(line: 92, scope: !788)
!796 = !DILocation(line: 93, scope: !788)
!797 = distinct !DISubprogram(name: "get<const u8*>", linkageName: "_ZN4core7nonzero8{{impl}}14get<const u8*>E", scope: !192, file: !220, line: 91, type: !798, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !773, variables: !162)
!798 = !DISubroutineType(types: !799)
!799 = !{!153, !192}
!800 = !DILocalVariable(name: "self", arg: 1, scope: !797, file: !164, line: 1, type: !192)
!801 = !DILocation(line: 1, scope: !797)
!802 = !DILocation(line: 92, scope: !797)
!803 = !DILocation(line: 93, scope: !797)
!804 = distinct !DISubprogram(name: "into_inner<alloc::allocator::AllocErr>", linkageName: "_ZN4core3mem8{{impl}}38into_inner<alloc::allocator::AllocErr>E", scope: !806, file: !805, line: 979, type: !822, isLocal: false, isDefinition: true, scopeLine: 979, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !824, variables: !162)
!805 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Cmem.rs", directory: "")
!806 = !DICompositeType(tag: DW_TAG_union_type, name: "ManuallyDrop<alloc::allocator::AllocErr>", scope: !807, file: !3, size: 192, align: 64, elements: !808, identifier: "3ba2f2b0f91b635e9c56ee5bac0b5d13")
!807 = !DINamespace(name: "mem", scope: !56, file: !3)
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !806, file: !3, baseType: !810, size: 192, align: 64)
!810 = !DICompositeType(tag: DW_TAG_union_type, name: "AllocErr", scope: !101, file: !3, size: 192, align: 64, elements: !811, identifier: "da60cfd1e6cb6dc1ed13091ad0778f7f")
!811 = !{!812, !817}
!812 = !DIDerivedType(tag: DW_TAG_member, scope: !810, file: !3, baseType: !813, size: 192, align: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "Exhausted", scope: !101, file: !3, size: 192, align: 64, elements: !814, identifier: "da60cfd1e6cb6dc1ed13091ad0778f7f::Exhausted")
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !813, file: !3, baseType: !100, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !813, file: !3, baseType: !649, size: 128, align: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, scope: !810, file: !3, baseType: !818, size: 192, align: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unsupported", scope: !101, file: !3, size: 192, align: 64, elements: !819, identifier: "da60cfd1e6cb6dc1ed13091ad0778f7f::Unsupported")
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !818, file: !3, baseType: !100, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "details", scope: !818, file: !3, baseType: !605, size: 128, align: 64, offset: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!810, !806}
!824 = !{!825}
!825 = !DITemplateTypeParameter(name: "T", type: !810)
!826 = !DILocation(line: 1, scope: !804)
!827 = !DILocalVariable(name: "slot", arg: 1, scope: !804, file: !164, line: 1, type: !806)
!828 = !DILocation(line: 981, scope: !829)
!829 = distinct !DILexicalBlock(scope: !804, file: !805, line: 980, column: 8)
!830 = !DILocation(line: 983, scope: !804)
!831 = distinct !DISubprogram(name: "new<alloc::allocator::AllocErr>", linkageName: "_ZN4core3mem8{{impl}}31new<alloc::allocator::AllocErr>E", scope: !806, file: !805, line: 964, type: !832, isLocal: false, isDefinition: true, scopeLine: 964, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !824, variables: !162)
!832 = !DISubroutineType(types: !833)
!833 = !{!806, !810}
!834 = !DILocation(line: 1, scope: !831)
!835 = !DILocalVariable(name: "value", arg: 1, scope: !831, file: !164, line: 1, type: !810)
!836 = !DILocation(line: 965, scope: !831)
!837 = !DILocation(line: 966, scope: !831)
!838 = distinct !DISubprogram(name: "flush_buf<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>", linkageName: "_ZN3std2io8buffered8{{impl}}59flush_buf<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>E", scope: !313, file: !839, line: 424, type: !840, isLocal: false, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !856, variables: !162)
!839 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibstd\5Cio\5Cbuffered.rs", directory: "")
!840 = !DISubroutineType(types: !841)
!841 = !{!842, !855}
!842 = !DICompositeType(tag: DW_TAG_union_type, name: "Result<(), std::io::error::Error>", scope: !96, file: !3, size: 192, align: 64, elements: !843, identifier: "ac01122f3f3dd558da39d9714646598e")
!843 = !{!844, !850}
!844 = !DIDerivedType(tag: DW_TAG_member, scope: !842, file: !3, baseType: !845, size: 64, align: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !96, file: !3, size: 64, align: 64, elements: !846, identifier: "ac01122f3f3dd558da39d9714646598e::Ok")
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !845, file: !3, baseType: !95, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !845, file: !3, baseType: !849, align: 8, offset: 64)
!849 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!850 = !DIDerivedType(tag: DW_TAG_member, scope: !842, file: !3, baseType: !851, size: 192, align: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !96, file: !3, size: 192, align: 64, elements: !852, identifier: "ac01122f3f3dd558da39d9714646598e::Err")
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !851, file: !3, baseType: !95, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !851, file: !3, baseType: !678, size: 128, align: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut std::io::buffered::BufWriter<std::io::stdio::Maybe<std::io::stdio::StdoutRaw>>*", baseType: !313, size: 64, align: 64)
!856 = !{!857}
!857 = !DITemplateTypeParameter(name: "W", type: !327)
!858 = !DILocalVariable(name: "self", arg: 1, scope: !838, file: !164, line: 1, type: !855)
!859 = !DILocation(line: 1, scope: !838)
!860 = !DILocalVariable(name: "written", scope: !861, file: !839, line: 425, type: !17, align: 8)
!861 = distinct !DILexicalBlock(scope: !838, file: !839, line: 425, column: 8)
!862 = !DILocation(line: 425, scope: !861)
!863 = !DILocalVariable(name: "len", scope: !864, file: !839, line: 426, type: !17, align: 8)
!864 = distinct !DILexicalBlock(scope: !861, file: !839, line: 426, column: 8)
!865 = !DILocation(line: 426, scope: !864)
!866 = !DILocalVariable(name: "ret", scope: !867, file: !839, line: 427, type: !842, align: 8)
!867 = distinct !DILexicalBlock(scope: !864, file: !839, line: 427, column: 8)
!868 = !DILocation(line: 427, scope: !867)
!869 = !DILocalVariable(name: "r", scope: !870, file: !839, line: 430, type: !721, align: 8)
!870 = distinct !DILexicalBlock(scope: !867, file: !839, line: 430, column: 12)
!871 = !DILocation(line: 430, scope: !870)
!872 = !DILocalVariable(name: "n", scope: !873, file: !839, line: 439, type: !17, align: 8)
!873 = distinct !DILexicalBlock(scope: !870, file: !839, line: 439, column: 25)
!874 = !DILocation(line: 439, scope: !873)
!875 = !DILocalVariable(name: "e", scope: !876, file: !839, line: 440, type: !738, align: 8)
!876 = distinct !DILexicalBlock(scope: !873, file: !839, line: 440, column: 72)
!877 = !DILocation(line: 440, scope: !876)
!878 = !DILocalVariable(name: "e", scope: !879, file: !839, line: 441, type: !678, align: 8)
!879 = distinct !DILexicalBlock(scope: !876, file: !839, line: 441, column: 26)
!880 = !DILocation(line: 441, scope: !879)
!881 = !DILocation(line: 428, scope: !867)
!882 = !DILocation(line: 445, scope: !867)
!883 = !DILocation(line: 429, scope: !867)
!884 = !DILocation(line: 424, scope: !838)
!885 = !DILocation(line: 449, scope: !864)
!886 = !DILocation(line: 431, scope: !870)
!887 = !DILocation(line: 434, scope: !879)
!888 = !DILocation(line: 433, scope: !879)
!889 = !DILocation(line: 435, scope: !870)
!890 = !DILocation(line: 439, scope: !879)
!891 = !DILocation(line: 443, scope: !870)
!892 = !DILocation(line: 449, scope: !838)
!893 = !DILocation(line: 440, scope: !879)
!894 = !DILocation(line: 444, scope: !867)
!895 = !DILocation(line: 446, scope: !867)
!896 = !DILocation(line: 448, scope: !867)
!897 = !DILocation(line: 437, scope: !870)
!898 = !DILocation(line: 437, scope: !867)
!899 = distinct !DISubprogram(name: "unwrap<(),std::io::error::Error>", linkageName: "_ZN4core6result8{{impl}}32unwrap<(),std::io::error::Error>E", scope: !842, file: !900, line: 769, type: !901, isLocal: false, isDefinition: true, scopeLine: 769, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !903, variables: !162)
!900 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Cresult.rs", directory: "")
!901 = !DISubroutineType(types: !902)
!902 = !{null, !842}
!903 = !{!904, !905}
!904 = !DITemplateTypeParameter(name: "T", type: !849)
!905 = !DITemplateTypeParameter(name: "E", type: !678)
!906 = !DILocation(line: 1, scope: !899)
!907 = !DILocalVariable(name: "self", arg: 1, scope: !899, file: !164, line: 1, type: !842)
!908 = !DILocalVariable(name: "t", scope: !909, file: !900, line: 771, type: !849, align: 1)
!909 = distinct !DILexicalBlock(scope: !899, file: !900, line: 771, column: 21)
!910 = !DILocation(line: 771, scope: !909)
!911 = !DILocalVariable(name: "e", scope: !912, file: !900, line: 772, type: !678, align: 8)
!912 = distinct !DILexicalBlock(scope: !909, file: !900, line: 772, column: 22)
!913 = !DILocation(line: 772, scope: !912)
!914 = !DILocation(line: 771, scope: !912)
!915 = !DILocation(line: 774, scope: !899)
!916 = !DILocation(line: 769, scope: !899)
!917 = distinct !DISubprogram(name: "from_elem", linkageName: "_ZN5alloc3vec8{{impl}}9from_elemE", scope: !172, file: !171, line: 1459, type: !918, isLocal: false, isDefinition: true, scopeLine: 1459, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !162, variables: !162)
!918 = !DISubroutineType(types: !919)
!919 = !{!181, !23, !17}
!920 = !DILocalVariable(name: "elem", arg: 1, scope: !917, file: !164, line: 1, type: !23)
!921 = !DILocation(line: 1, scope: !917)
!922 = !DILocalVariable(name: "n", arg: 2, scope: !917, file: !164, line: 1, type: !17)
!923 = !DILocalVariable(name: "v", scope: !924, file: !171, line: 1467, type: !181, align: 8)
!924 = distinct !DILexicalBlock(scope: !925, file: !171, line: 1467, column: 12)
!925 = distinct !DILexicalBlock(scope: !917, file: !171, line: 1466, column: 8)
!926 = !DILocation(line: 1467, scope: !924)
!927 = !DILocation(line: 1460, scope: !917)
!928 = !DILocation(line: 1462, scope: !917)
!929 = !DILocation(line: 1463, scope: !917)
!930 = !DILocation(line: 1461, scope: !917)
!931 = !DILocation(line: 1472, scope: !917)
!932 = !DILocation(line: 1468, scope: !924)
!933 = !DILocation(line: 1459, scope: !917)
!934 = !DILocation(line: 1471, scope: !925)
!935 = !DILocation(line: 1469, scope: !924)
!936 = !DILocation(line: 1470, scope: !924)
!937 = distinct !DISubprogram(name: "allocate_in<u8,alloc::heap::Heap>", linkageName: "_ZN5alloc7raw_vec8{{impl}}33allocate_in<u8,alloc::heap::Heap>E", scope: !184, file: !748, line: 82, type: !938, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !940, variables: !162)
!938 = !DISubroutineType(types: !939)
!939 = !{!184, !17, !345, !201}
!940 = !{!161, !941}
!941 = !DITemplateTypeParameter(name: "A", type: !201)
!942 = !DILocalVariable(name: "cap", arg: 1, scope: !937, file: !164, line: 1, type: !17)
!943 = !DILocation(line: 1, scope: !937)
!944 = !DILocalVariable(name: "zeroed", arg: 2, scope: !937, file: !164, line: 1, type: !345)
!945 = !DILocalVariable(name: "a", arg: 3, scope: !937, file: !164, line: 1, type: !201)
!946 = !DILocalVariable(name: "elem_size", scope: !947, file: !748, line: 84, type: !17, align: 8)
!947 = distinct !DILexicalBlock(scope: !948, file: !748, line: 84, column: 12)
!948 = distinct !DILexicalBlock(scope: !937, file: !748, line: 83, column: 8)
!949 = !DILocation(line: 84, scope: !947)
!950 = !DILocalVariable(name: "alloc_size", scope: !951, file: !748, line: 86, type: !17, align: 8)
!951 = distinct !DILexicalBlock(scope: !947, file: !748, line: 86, column: 12)
!952 = !DILocation(line: 86, scope: !951)
!953 = !DILocalVariable(name: "ptr", scope: !954, file: !748, line: 90, type: !519, align: 8)
!954 = distinct !DILexicalBlock(scope: !951, file: !748, line: 90, column: 12)
!955 = !DILocation(line: 90, scope: !954)
!956 = !DILocalVariable(name: "align", scope: !957, file: !748, line: 93, type: !17, align: 8)
!957 = distinct !DILexicalBlock(scope: !954, file: !748, line: 93, column: 16)
!958 = !DILocation(line: 93, scope: !957)
!959 = !DILocalVariable(name: "result", scope: !960, file: !748, line: 94, type: !961, align: 8)
!960 = distinct !DILexicalBlock(scope: !957, file: !748, line: 94, column: 16)
!961 = !DICompositeType(tag: DW_TAG_union_type, name: "Result<mut u8*, alloc::allocator::AllocErr>", scope: !96, file: !3, size: 256, align: 64, elements: !962, identifier: "48e34bfe103cd894fab4de1ea9305168")
!962 = !{!963, !968}
!963 = !DIDerivedType(tag: DW_TAG_member, scope: !961, file: !3, baseType: !964, size: 128, align: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !96, file: !3, size: 128, align: 64, elements: !965, identifier: "48e34bfe103cd894fab4de1ea9305168::Ok")
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !964, file: !3, baseType: !95, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !964, file: !3, baseType: !519, size: 64, align: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, scope: !961, file: !3, baseType: !969, size: 256, align: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !96, file: !3, size: 256, align: 64, elements: !970, identifier: "48e34bfe103cd894fab4de1ea9305168::Err")
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !969, file: !3, baseType: !95, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !969, file: !3, baseType: !810, size: 192, align: 64, offset: 64)
!973 = !DILocation(line: 94, scope: !960)
!974 = !DILocalVariable(name: "ptr", scope: !975, file: !748, line: 100, type: !519, align: 8)
!975 = distinct !DILexicalBlock(scope: !960, file: !748, line: 100, column: 31)
!976 = !DILocation(line: 100, scope: !975)
!977 = !DILocalVariable(name: "err", scope: !978, file: !748, line: 101, type: !810, align: 8)
!978 = distinct !DILexicalBlock(scope: !975, file: !748, line: 101, column: 32)
!979 = !DILocation(line: 101, scope: !978)
!980 = !DILocation(line: 82, scope: !937)
!981 = !DILocation(line: 111, scope: !937)
!982 = !DILocation(line: 87, scope: !951)
!983 = !DILocation(line: 91, scope: !954)
!984 = !DILocation(line: 95, scope: !960)
!985 = !DILocation(line: 97, scope: !960)
!986 = !DILocation(line: 100, scope: !978)
!987 = !DILocation(line: 106, scope: !954)
!988 = !DILocation(line: 107, scope: !954)
!989 = !DILocation(line: 105, scope: !954)
!990 = distinct !DISubprogram(name: "current_layout<u8,alloc::heap::Heap>", linkageName: "_ZN5alloc7raw_vec8{{impl}}36current_layout<u8,alloc::heap::Heap>E", scope: !184, file: !748, line: 224, type: !991, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !940, variables: !162)
!991 = !DISubroutineType(types: !992)
!992 = !{!638, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::raw_vec::RawVec<u8, alloc::heap::Heap>*", baseType: !184, size: 64, align: 64)
!994 = !DILocalVariable(name: "self", arg: 1, scope: !990, file: !164, line: 1, type: !993)
!995 = !DILocation(line: 1, scope: !990)
!996 = !DILocalVariable(name: "align", scope: !997, file: !748, line: 231, type: !17, align: 8)
!997 = distinct !DILexicalBlock(scope: !998, file: !748, line: 231, column: 16)
!998 = distinct !DILexicalBlock(scope: !990, file: !748, line: 230, column: 12)
!999 = !DILocation(line: 231, scope: !997)
!1000 = !DILocalVariable(name: "size", scope: !1001, file: !748, line: 232, type: !17, align: 8)
!1001 = distinct !DILexicalBlock(scope: !997, file: !748, line: 232, column: 16)
!1002 = !DILocation(line: 232, scope: !1001)
!1003 = !DILocation(line: 225, scope: !990)
!1004 = !DILocation(line: 226, scope: !990)
!1005 = !DILocation(line: 233, scope: !1001)
!1006 = !DILocation(line: 236, scope: !990)
!1007 = distinct !DISubprogram(name: "dealloc_buffer<u8,alloc::heap::Heap>", linkageName: "_ZN5alloc7raw_vec8{{impl}}36dealloc_buffer<u8,alloc::heap::Heap>E", scope: !184, file: !748, line: 682, type: !1008, isLocal: false, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !940, variables: !162)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut alloc::raw_vec::RawVec<u8, alloc::heap::Heap>*", baseType: !184, size: 64, align: 64)
!1011 = !DILocalVariable(name: "self", arg: 1, scope: !1007, file: !164, line: 1, type: !1010)
!1012 = !DILocation(line: 1, scope: !1007)
!1013 = !DILocalVariable(name: "elem_size", scope: !1014, file: !748, line: 683, type: !17, align: 8)
!1014 = distinct !DILexicalBlock(scope: !1007, file: !748, line: 683, column: 8)
!1015 = !DILocation(line: 683, scope: !1014)
!1016 = !DILocalVariable(name: "layout", scope: !1017, file: !748, line: 685, type: !649, align: 8)
!1017 = distinct !DILexicalBlock(scope: !1014, file: !748, line: 685, column: 56)
!1018 = !DILocation(line: 685, scope: !1017)
!1019 = !DILocalVariable(name: "ptr", scope: !1020, file: !748, line: 686, type: !519, align: 8)
!1020 = distinct !DILexicalBlock(scope: !1017, file: !748, line: 686, column: 16)
!1021 = !DILocation(line: 686, scope: !1020)
!1022 = !DILocation(line: 684, scope: !1014)
!1023 = !DILocation(line: 685, scope: !1014)
!1024 = !DILocation(line: 687, scope: !1020)
!1025 = !DILocation(line: 690, scope: !1007)
!1026 = distinct !DISubprogram(name: "ptr<u8,alloc::heap::Heap>", linkageName: "_ZN5alloc7raw_vec8{{impl}}25ptr<u8,alloc::heap::Heap>E", scope: !184, file: !748, line: 198, type: !1027, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !940, variables: !162)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!519, !993}
!1029 = !DILocalVariable(name: "self", arg: 1, scope: !1026, file: !164, line: 1, type: !993)
!1030 = !DILocation(line: 1, scope: !1026)
!1031 = !DILocation(line: 199, scope: !1026)
!1032 = !DILocation(line: 200, scope: !1026)
!1033 = distinct !DISubprogram(name: "add_usize", linkageName: "_ZN4core4iter5range8{{impl}}9add_usizeE", scope: !1035, file: !1034, line: 125, type: !1038, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !162, variables: !162)
!1034 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Citer\5Crange.rs", directory: "")
!1035 = !DINamespace(name: "{{impl}}", scope: !1036, file: !3)
!1036 = !DINamespace(name: "range", scope: !1037, file: !3)
!1037 = !DINamespace(name: "iter", scope: !56, file: !3)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!1040, !1052, !17}
!1040 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<isize>", scope: !55, file: !3, size: 128, align: 64, elements: !1041, identifier: "d50d878a193c4e255ce35faf2d4f3a9f")
!1041 = !{!1042, !1046}
!1042 = !DIDerivedType(tag: DW_TAG_member, scope: !1040, file: !3, baseType: !1043, size: 64, align: 64)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !55, file: !3, size: 64, align: 64, elements: !1044, identifier: "d50d878a193c4e255ce35faf2d4f3a9f::None")
!1044 = !{!1045}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !1043, file: !3, baseType: !67, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, scope: !1040, file: !3, baseType: !1047, size: 128, align: 64)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !55, file: !3, size: 128, align: 64, elements: !1048, identifier: "d50d878a193c4e255ce35faf2d4f3a9f::Some")
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !1047, file: !3, baseType: !67, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1047, file: !3, baseType: !1051, size: 64, align: 64, offset: 64)
!1051 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "isize*", baseType: !1051, size: 64, align: 64)
!1053 = !DILocalVariable(name: "self", arg: 1, scope: !1033, file: !164, line: 1, type: !1052)
!1054 = !DILocation(line: 1, scope: !1033)
!1055 = !DILocalVariable(name: "n", arg: 2, scope: !1033, file: !164, line: 1, type: !17)
!1056 = !DILocalVariable(name: "n_as_unsigned", scope: !1057, file: !1034, line: 127, type: !17, align: 8)
!1057 = distinct !DILexicalBlock(scope: !1033, file: !1034, line: 127, column: 41)
!1058 = !DILocation(line: 127, scope: !1057)
!1059 = !DILocalVariable(name: "wrapped", scope: !1060, file: !1034, line: 131, type: !1051, align: 8)
!1060 = distinct !DILexicalBlock(scope: !1057, file: !1034, line: 131, column: 24)
!1061 = !DILocation(line: 131, scope: !1060)
!1062 = !DILocation(line: 126, scope: !1033)
!1063 = !DILocation(line: 132, scope: !1060)
!1064 = !DILocation(line: 133, scope: !1060)
!1065 = !DILocation(line: 135, scope: !1060)
!1066 = !DILocation(line: 140, scope: !1033)
!1067 = distinct !DISubprogram(name: "add_usize", linkageName: "_ZN4core4iter5range8{{impl}}9add_usizeE", scope: !1035, file: !1034, line: 93, type: !1068, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !162, variables: !162)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!592, !1070, !17}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usize*", baseType: !17, size: 64, align: 64)
!1071 = !DILocalVariable(name: "self", arg: 1, scope: !1067, file: !164, line: 1, type: !1070)
!1072 = !DILocation(line: 1, scope: !1067)
!1073 = !DILocalVariable(name: "n", arg: 2, scope: !1067, file: !164, line: 1, type: !17)
!1074 = !DILocalVariable(name: "n_as_t", scope: !1075, file: !1034, line: 95, type: !17, align: 8)
!1075 = distinct !DILexicalBlock(scope: !1067, file: !1034, line: 95, column: 34)
!1076 = !DILocation(line: 95, scope: !1075)
!1077 = !DILocation(line: 94, scope: !1067)
!1078 = !DILocation(line: 98, scope: !1067)
!1079 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3Ord10min<usize>E", scope: !1081, file: !1080, line: 476, type: !1083, isLocal: false, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !1085, variables: !162)
!1080 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Ccmp.rs", directory: "")
!1081 = !DINamespace(name: "Ord", scope: !1082, file: !3)
!1082 = !DINamespace(name: "cmp", scope: !56, file: !3)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!17, !17, !17}
!1085 = !{!1086}
!1086 = !DITemplateTypeParameter(name: "Self", type: !17)
!1087 = !DILocalVariable(name: "self", arg: 1, scope: !1079, file: !164, line: 1, type: !17)
!1088 = !DILocation(line: 1, scope: !1079)
!1089 = !DILocalVariable(name: "other", arg: 2, scope: !1079, file: !164, line: 1, type: !17)
!1090 = !DILocation(line: 478, scope: !1079)
!1091 = !DILocation(line: 476, scope: !1079)
!1092 = !DILocation(line: 479, scope: !1079)
!1093 = distinct !DISubprogram(name: "lt", linkageName: "_ZN4core3cmp5impls8{{impl}}2ltE", scope: !1094, file: !1080, line: 846, type: !1096, isLocal: false, isDefinition: true, scopeLine: 846, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !162, variables: !162)
!1094 = !DINamespace(name: "{{impl}}", scope: !1095, file: !3)
!1095 = !DINamespace(name: "impls", scope: !1082, file: !3)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!345, !1052, !1052}
!1098 = !DILocalVariable(name: "self", arg: 1, scope: !1093, file: !164, line: 1, type: !1052)
!1099 = !DILocation(line: 1, scope: !1093)
!1100 = !DILocalVariable(name: "other", arg: 2, scope: !1093, file: !164, line: 1, type: !1052)
!1101 = !DILocation(line: 846, scope: !1093)
!1102 = distinct !DISubprogram(name: "le", linkageName: "_ZN4core3cmp5impls8{{impl}}2leE", scope: !1094, file: !1080, line: 848, type: !1103, isLocal: false, isDefinition: true, scopeLine: 848, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !162, variables: !162)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!345, !1070, !1070}
!1105 = !DILocalVariable(name: "self", arg: 1, scope: !1102, file: !164, line: 1, type: !1070)
!1106 = !DILocation(line: 1, scope: !1102)
!1107 = !DILocalVariable(name: "other", arg: 2, scope: !1102, file: !164, line: 1, type: !1070)
!1108 = !DILocation(line: 848, scope: !1102)
!1109 = distinct !DISubprogram(name: "lt", linkageName: "_ZN4core3cmp5impls8{{impl}}2ltE", scope: !1094, file: !1080, line: 846, type: !1103, isLocal: false, isDefinition: true, scopeLine: 846, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !162, variables: !162)
!1110 = !DILocalVariable(name: "self", arg: 1, scope: !1109, file: !164, line: 1, type: !1070)
!1111 = !DILocation(line: 1, scope: !1109)
!1112 = !DILocalVariable(name: "other", arg: 2, scope: !1109, file: !164, line: 1, type: !1070)
!1113 = !DILocation(line: 846, scope: !1109)
!1114 = distinct !DISubprogram(name: "new<std::io::error::Error>", linkageName: "_ZN4core3fmt8{{impl}}26new<std::io::error::Error>E", scope: !1116, file: !1115, line: 297, type: !1167, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: false, unit: !46, templateParams: !1172, variables: !162)
!1115 = !DIFile(filename: "C:\5Cprojects\5Crust\5Csrc\5Clibcore\5Cfmt\5Cmod.rs", directory: "")
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !110, file: !3, size: 128, align: 64, elements: !1117, identifier: "3fd06d152ff3f4494594c60f68266e7f")
!1117 = !{!1118, !1123}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1116, file: !3, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "core::fmt::Void*", baseType: !1120, size: 64, align: 64)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Void", scope: !110, file: !3, align: 8, elements: !1121, identifier: "1f72c441b7f11b576ab5fb5fb52d0cfb")
!1121 = !{!1122}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_priv", scope: !1120, file: !3, baseType: !849, align: 8)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !1116, file: !3, baseType: !1124, size: 64, align: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(core::fmt::Void*, mut core::fmt::Formatter*) -> core::result::Result<(), core::fmt::Error>", baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!1127, !1119, !1140}
!1127 = !DICompositeType(tag: DW_TAG_union_type, name: "Result<(), core::fmt::Error>", scope: !96, file: !3, size: 8, align: 8, elements: !1128, identifier: "271d01ec2c4ebbecdd335d1a099f57")
!1128 = !{!1129, !1134}
!1129 = !DIDerivedType(tag: DW_TAG_member, scope: !1127, file: !3, baseType: !1130, size: 8, align: 8)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !96, file: !3, size: 8, align: 8, elements: !1131, identifier: "271d01ec2c4ebbecdd335d1a099f57::Ok")
!1131 = !{!1132, !1133}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !1130, file: !3, baseType: !106, size: 8, align: 8)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1130, file: !3, baseType: !849, align: 8, offset: 8)
!1134 = !DIDerivedType(tag: DW_TAG_member, scope: !1127, file: !3, baseType: !1135, size: 8, align: 8)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !96, file: !3, size: 8, align: 8, elements: !1136, identifier: "271d01ec2c4ebbecdd335d1a099f57::Err")
!1136 = !{!1137, !1138}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !1135, file: !3, baseType: !106, size: 8, align: 8)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1135, file: !3, baseType: !1139, align: 8, offset: 8)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !110, file: !3, align: 8, elements: !162, identifier: "b3413e4503e3d47fc7879cbd202c84")
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "mut core::fmt::Formatter*", baseType: !1141, size: 64, align: 64)
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !110, file: !3, size: 768, align: 64, elements: !1142, identifier: "fb02608bf4fd8a2d7facaa51e561d53b")
!1142 = !{!1143, !1144, !1146, !1147, !1148, !1149, !1154, !1162}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !3, baseType: !37, size: 32, align: 32, offset: 640)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1141, file: !3, baseType: !1145, size: 32, align: 32, offset: 672)
!1145 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1141, file: !3, baseType: !107, size: 8, align: 8, offset: 704)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1141, file: !3, baseType: !592, size: 128, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1141, file: !3, baseType: !592, size: 128, align: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1141, file: !3, baseType: !1150, size: 128, align: 64, offset: 256)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "mut Write*", scope: !110, file: !3, size: 128, align: 64, elements: !1151, identifier: "f3c82cf2d14f7b8dd6dc7aa4e9f1235")
!1151 = !{!1152, !1153}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1150, file: !3, baseType: !153, size: 64, align: 64, flags: DIFlagArtificial)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1150, file: !3, baseType: !153, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "curarg", scope: !1141, file: !3, baseType: !1155, size: 128, align: 64, offset: 384)
